#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CallahanCloud/learn-terraform-github-actions/runs/run-mXcEXY6CQWgukRQK

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=musical-jawfish]
aws_security_group.web-sg: Refreshing state... [id=sg-03bf752de932c1a7d]
data.aws_ami.ubuntu: Refreshing...
aws_instance.web: Refreshing state... [id=i-0c107d56055273ae1]
data.aws_ami.ubuntu: Refresh complete after 1s [id=ami-0033b8d4af707c36f]
aws_instance.web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_instance.web will be updated in-place
  ~ resource "aws_instance" "web" {
        id                                   = "i-0c107d56055273ae1"
        tags                                 = {}
      ~ vpc_security_group_ids               = [
          - "sg-03bf752de932c1a7d",
        ] -> (known after apply)
        # (37 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_security_group.web-sg will be destroyed
  - resource "aws_security_group" "web-sg" {
      - arn                    = "arn:aws:ec2:eu-west-1:980921712667:security-group/sg-03bf752de932c1a7d" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-03bf752de932c1a7d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "musical-jawfish-sg" -> null
      - owner_id               = "980921712667" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0b20703eda00bc068" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.web-sg8 will be created
  + resource "aws_security_group" "web-sg8" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "musical-jawfish-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Bassdanger, Action: `pull_request`*